NextFOAM-2506/tutorials/lagrangian/kinematicParcelFoam/drippingChair/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            totalPressure;
        p0              uniform 0;
    }

    "(filmWalls|sides|frontAndBack)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
